 var data = {
     '222877': {
         value: [{
             head: '云计算',
             list: ['云计算基础架构', '云平台', '大数据', '虚拟化技术']
         }, {
             head: '云计算',
             list: ['云计算基础架构',
                 '云平台', '大数据', '虚拟化技术'
             ]
         }]
     },
     '222878': {
         value: [{
             head: '云计算',
             list: ['云计算基础架构', '云平台', '大数据', '虚拟化技术']
         }, {
             head: '云计算',
             list: ['云计算基础架构', '云平台', '大数据', '虚拟化技术']
         }, {
             head: '云计算',
             list: ['云计算基础架构', '云平台', '大数据', '虚拟化技术']
         }]
     },
     '222879': {
         value: [{
             head: '云计算',
             list: ['云计算基础架构', '云平台', '大数据', '虚拟化技术']
         }, {
             head: '云计算',
             list: ['云计算基础架构', '云计算基础架构', '云计算基础架构', '云计算基础架构',
                 '云平台', '大数据', '虚拟化技术'
             ]
         }, {
             head: '云计算',
             list: ['云计算基础架构', '云平台', '大数据', '虚拟化技术']
         }]
     },
     '222880': {
         value: [{
             head: '云计算',
             list: ['云计算基础架构', '云平台', '大数据', '虚拟化技术']
         }, {
             head: '云计算',
             list: ['云计算基础架构', '云平台', '大数据', '虚拟化技术']
         }]
     },
     '222881': {
         value: [{
             head: '云计算',
             list: ['云计算基础架构', '云平台', '大数据', '虚拟化技术']
         }, {
             head: '云计算',
             list: ['云计算基础架构', '大数据', '云平台', '云平台', '云平台',
                 '云平台', '大数据', '虚拟化技术'
             ]
         }, {
             head: '云计算',
             list: ['云计算基础架构', '云平台', '大数据', '虚拟化技术']
         }]
     },
     '222882': {
         value: [{
             head: '云计算',
             list: ['云计算基础架构', '云平台', '大数据', '虚拟化技术']
         }, {
             head: '云计算',
             list: ['云计算基础架构', '云平台', '大数据', '虚拟化技术']
         }, {
             head: '云计算',
             list: ['云计算基础架构', '云平台', '大数据', '虚拟化技术', '大数据', '大数据', '大数据']
         }]
     },
     '222883': {
         value: [{
             head: '云计算',
             list: ['云计算基础架构', '云平台',
                 '大数据', '虚拟化技术'
             ]
         }, {
             head: '云计算',
             list: ['云计算基础架构', '云平台', '大数据', '虚拟化技术', '大数据', '大数据', '大数据']
         }, {
             head: '云计算',
             list: ['云计算基础架构', '云平台', '大数据', '虚拟化技术']
         }]
     },
     '222884': {
         value: [{
             head: '云计算',
             list: ['云计算基础架构', '云平台', '大数据', '虚拟化技术', '大数据']
         }, {
             head: '云计算',
             list: ['云计算基础架构', '云平台', '大数据', '虚拟化技术']
         }]
     },
     '222885': {
         value: [{
             head: '云计算',
             list: ['云计算基础架构', '云平台',
                 '大数据', '虚拟化技术'
             ]
         }, {
             head: '云计算',
             list: ['云计算基础架构', '云平台', '大数据', '虚拟化技术']
         }, {
             head: '云计算',
             list: ['云计算基础架构', '云平台', '大数据',
                 '虚拟化技术', '大数据', '大数据'
             ]
         }]
     }
 }

 // 鼠标移入对象选项，获取到对应的数据 
 $('.side-tab-item').hover(mouseoverHandler);

 $('.side-tab').hover(function() {
     $('.side-content').show();
 }, function() {
     $('.side-content').hide();
 })


 function mouseoverHandler() {

     $('.side-content').html('').show();

     let dataItem = data[$(this).attr('id')]['value'];

     let str = ``;
     for (let i = 0; i < dataItem.length; i++) {

         str += `<h3>${ dataItem[i].head}</h3><p>`

         for (let j = 0; j < dataItem[i].list.length; j++) {
             str += `<span>${dataItem[i].list[j]}</span>`
         }
         str += '</p>'

     }
     $('.side-content').html(str);

 }